balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66J90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA13" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA13" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA13" edc:desc="" edc:mask="0xff" edc:name="LCDDATA13" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C2" edc:desc="" edc:mask="0x1" edc:name="S8C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S9C2" edc:desc="" edc:mask="0x1" edc:name="S9C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C2" edc:desc="" edc:mask="0x1" edc:name="S10C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C2" edc:desc="" edc:mask="0x1" edc:name="S11C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C2" edc:desc="" edc:mask="0x1" edc:name="S12C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C2" edc:desc="" edc:mask="0x1" edc:name="S13C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C2" edc:desc="" edc:mask="0x1" edc:name="S14C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C2" edc:desc="" edc:mask="0x1" edc:name="S15C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM2" edc:desc="" edc:mask="0x1" edc:name="SEG8COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM2" edc:desc="" edc:mask="0x1" edc:name="SEG9COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM2" edc:desc="" edc:mask="0x1" edc:name="SEG10COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM2" edc:desc="" edc:mask="0x1" edc:name="SEG11COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM2" edc:desc="" edc:mask="0x1" edc:name="SEG12COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM2" edc:desc="" edc:mask="0x1" edc:name="SEG13COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM2" edc:desc="" edc:mask="0x1" edc:name="SEG14COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM2" edc:desc="" edc:mask="0x1" edc:name="SEG15COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C2" edc:desc="" edc:mask="0x1" edc:name="S08C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C2" edc:desc="" edc:mask="0x1" edc:name="S09C2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA14" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA14" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA14" edc:desc="" edc:mask="0xff" edc:name="LCDDATA14" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C2" edc:desc="" edc:mask="0x1" edc:name="S16C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C2" edc:desc="" edc:mask="0x1" edc:name="S17C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C2" edc:desc="" edc:mask="0x1" edc:name="S18C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C2" edc:desc="" edc:mask="0x1" edc:name="S19C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C2" edc:desc="" edc:mask="0x1" edc:name="S20C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C2" edc:desc="" edc:mask="0x1" edc:name="S21C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C2" edc:desc="" edc:mask="0x1" edc:name="S22C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C2" edc:desc="" edc:mask="0x1" edc:name="S23C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM2" edc:desc="" edc:mask="0x1" edc:name="SEG16COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM2" edc:desc="" edc:mask="0x1" edc:name="SEG17COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM2" edc:desc="" edc:mask="0x1" edc:name="SEG18COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM2" edc:desc="" edc:mask="0x1" edc:name="SEG19COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM2" edc:desc="" edc:mask="0x1" edc:name="SEG20COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM2" edc:desc="" edc:mask="0x1" edc:name="SEG21COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM2" edc:desc="" edc:mask="0x1" edc:name="SEG22COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM2" edc:desc="" edc:mask="0x1" edc:name="SEG23COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA15" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA15" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA15" edc:desc="" edc:mask="0xff" edc:name="LCDDATA15" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S24C2" edc:desc="" edc:mask="0x1" edc:name="S24C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C2" edc:desc="" edc:mask="0x1" edc:name="S25C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C2" edc:desc="" edc:mask="0x1" edc:name="S26C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C2" edc:desc="" edc:mask="0x1" edc:name="S27C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C2" edc:desc="" edc:mask="0x1" edc:name="S28C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C2" edc:desc="" edc:mask="0x1" edc:name="S29C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C2" edc:desc="" edc:mask="0x1" edc:name="S30C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C2" edc:desc="" edc:mask="0x1" edc:name="S31C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG24COM2" edc:desc="" edc:mask="0x1" edc:name="SEG24COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM2" edc:desc="" edc:mask="0x1" edc:name="SEG25COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM2" edc:desc="" edc:mask="0x1" edc:name="SEG26COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM2" edc:desc="" edc:mask="0x1" edc:name="SEG27COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM2" edc:desc="" edc:mask="0x1" edc:name="SEG28COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM2" edc:desc="" edc:mask="0x1" edc:name="SEG29COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM2" edc:desc="" edc:mask="0x1" edc:name="SEG30COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM2" edc:desc="" edc:mask="0x1" edc:name="SEG31COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="LCDDATA16" edc:desc="" edc:impl="0x01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------u" edc:name="LCDDATA16" edc:nzwidth="0x8" edc:por="-------x">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA16" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="LCDDATA16" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C2" edc:desc="" edc:mask="0x1" edc:name="S32C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM2" edc:desc="" edc:mask="0x1" edc:name="SEG32COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA18" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA18" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA18" edc:desc="" edc:mask="0xff" edc:name="LCDDATA18" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S00C3" edc:desc="" edc:mask="0x1" edc:name="S00C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C3" edc:desc="" edc:mask="0x1" edc:name="S01C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C3" edc:desc="" edc:mask="0x1" edc:name="S02C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C3" edc:desc="" edc:mask="0x1" edc:name="S03C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C3" edc:desc="" edc:mask="0x1" edc:name="S04C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C3" edc:desc="" edc:mask="0x1" edc:name="S05C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C3" edc:desc="" edc:mask="0x1" edc:name="S06C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C3" edc:desc="" edc:mask="0x1" edc:name="S07C3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG00COM3" edc:desc="" edc:mask="0x1" edc:name="SEG00COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG01COM3" edc:desc="" edc:mask="0x1" edc:name="SEG01COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG02COM3" edc:desc="" edc:mask="0x1" edc:name="SEG02COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG03COM3" edc:desc="" edc:mask="0x1" edc:name="SEG03COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG04COM3" edc:desc="" edc:mask="0x1" edc:name="SEG04COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG05COM3" edc:desc="" edc:mask="0x1" edc:name="SEG05COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG06COM3" edc:desc="" edc:mask="0x1" edc:name="SEG06COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG07COM3" edc:desc="" edc:mask="0x1" edc:name="SEG07COM3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S0C3" edc:desc="" edc:mask="0x1" edc:name="S0C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S1C3" edc:desc="" edc:mask="0x1" edc:name="S1C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S2C3" edc:desc="" edc:mask="0x1" edc:name="S2C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S3C3" edc:desc="" edc:mask="0x1" edc:name="S3C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S4C3" edc:desc="" edc:mask="0x1" edc:name="S4C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S5C3" edc:desc="" edc:mask="0x1" edc:name="S5C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S6C3" edc:desc="" edc:mask="0x1" edc:name="S6C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S7C3" edc:desc="" edc:mask="0x1" edc:name="S7C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
