balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66J90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA1" edc:desc="" edc:mask="0xff" edc:name="LCDDATA1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C0" edc:desc="" edc:mask="0x1" edc:name="S8C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S9C0" edc:desc="" edc:mask="0x1" edc:name="S9C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C0" edc:desc="" edc:mask="0x1" edc:name="S10C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C0" edc:desc="" edc:mask="0x1" edc:name="S11C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C0" edc:desc="" edc:mask="0x1" edc:name="S12C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C0" edc:desc="" edc:mask="0x1" edc:name="S13C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C0" edc:desc="" edc:mask="0x1" edc:name="S14C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C0" edc:desc="" edc:mask="0x1" edc:name="S15C0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM0" edc:desc="" edc:mask="0x1" edc:name="SEG8COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM0" edc:desc="" edc:mask="0x1" edc:name="SEG9COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM0" edc:desc="" edc:mask="0x1" edc:name="SEG10COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM0" edc:desc="" edc:mask="0x1" edc:name="SEG11COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM0" edc:desc="" edc:mask="0x1" edc:name="SEG12COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM0" edc:desc="" edc:mask="0x1" edc:name="SEG13COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM0" edc:desc="" edc:mask="0x1" edc:name="SEG14COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM0" edc:desc="" edc:mask="0x1" edc:name="SEG15COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C0" edc:desc="" edc:mask="0x1" edc:name="S08C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C0" edc:desc="" edc:mask="0x1" edc:name="S09C0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA2" edc:desc="" edc:mask="0xff" edc:name="LCDDATA2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C0" edc:desc="" edc:mask="0x1" edc:name="S16C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C0" edc:desc="" edc:mask="0x1" edc:name="S17C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C0" edc:desc="" edc:mask="0x1" edc:name="S18C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C0" edc:desc="" edc:mask="0x1" edc:name="S19C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C0" edc:desc="" edc:mask="0x1" edc:name="S20C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C0" edc:desc="" edc:mask="0x1" edc:name="S21C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C0" edc:desc="" edc:mask="0x1" edc:name="S22C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C0" edc:desc="" edc:mask="0x1" edc:name="S23C0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM0" edc:desc="" edc:mask="0x1" edc:name="SEG16COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM0" edc:desc="" edc:mask="0x1" edc:name="SEG17COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM0" edc:desc="" edc:mask="0x1" edc:name="SEG18COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM0" edc:desc="" edc:mask="0x1" edc:name="SEG19COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM0" edc:desc="" edc:mask="0x1" edc:name="SEG20COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM0" edc:desc="" edc:mask="0x1" edc:name="SEG21COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM0" edc:desc="" edc:mask="0x1" edc:name="SEG22COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM0" edc:desc="" edc:mask="0x1" edc:name="SEG23COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA3" edc:desc="" edc:mask="0xff" edc:name="LCDDATA3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S24C0" edc:desc="" edc:mask="0x1" edc:name="S24C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C0" edc:desc="" edc:mask="0x1" edc:name="S25C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C0" edc:desc="" edc:mask="0x1" edc:name="S26C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C0" edc:desc="" edc:mask="0x1" edc:name="S27C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C0" edc:desc="" edc:mask="0x1" edc:name="S28C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C0" edc:desc="" edc:mask="0x1" edc:name="S29C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C0" edc:desc="" edc:mask="0x1" edc:name="S30C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C0" edc:desc="" edc:mask="0x1" edc:name="S31C0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG24COM0" edc:desc="" edc:mask="0x1" edc:name="SEG24COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM0" edc:desc="" edc:mask="0x1" edc:name="SEG25COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM0" edc:desc="" edc:mask="0x1" edc:name="SEG26COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM0" edc:desc="" edc:mask="0x1" edc:name="SEG27COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM0" edc:desc="" edc:mask="0x1" edc:name="SEG28COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM0" edc:desc="" edc:mask="0x1" edc:name="SEG29COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM0" edc:desc="" edc:mask="0x1" edc:name="SEG30COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM0" edc:desc="" edc:mask="0x1" edc:name="SEG31COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA4" edc:desc="" edc:mask="0xff" edc:name="LCDDATA4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C0" edc:desc="" edc:mask="0x1" edc:name="S32C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C0" edc:desc="" edc:mask="0x1" edc:name="S33C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C0" edc:desc="" edc:mask="0x1" edc:name="S34C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C0" edc:desc="" edc:mask="0x1" edc:name="S35C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C0" edc:desc="" edc:mask="0x1" edc:name="S36C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C0" edc:desc="" edc:mask="0x1" edc:name="S37C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C0" edc:desc="" edc:mask="0x1" edc:name="S38C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C0" edc:desc="" edc:mask="0x1" edc:name="S39C0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM0" edc:desc="" edc:mask="0x1" edc:name="SEG32COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM0" edc:desc="" edc:mask="0x1" edc:name="SEG33COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM0" edc:desc="" edc:mask="0x1" edc:name="SEG34COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM0" edc:desc="" edc:mask="0x1" edc:name="SEG35COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM0" edc:desc="" edc:mask="0x1" edc:name="SEG36COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM0" edc:desc="" edc:mask="0x1" edc:name="SEG37COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM0" edc:desc="" edc:mask="0x1" edc:name="SEG38COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM0" edc:desc="" edc:mask="0x1" edc:name="SEG39COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="ADCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="ADCON2" edc:nzwidth="0x8" edc:por="0-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ACQT" edc:desc="" edc:mask="0x7" edc:name="ACQT" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:desc="" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:desc="" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:desc="" edc:mask="0x1" edc:name="ADCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:desc="" edc:mask="0x1" edc:name="ADCS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACQT0" edc:desc="" edc:mask="0x1" edc:name="ACQT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACQT1" edc:desc="" edc:mask="0x1" edc:name="ACQT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACQT2" edc:desc="" edc:mask="0x1" edc:name="ACQT2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="ADCON1" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="ADCON1" edc:nzwidth="0x8" edc:por="0-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCFG" edc:desc="" edc:mask="0xf" edc:name="PCFG" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="VCFG" edc:desc="" edc:mask="0x3" edc:name="VCFG" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCFG0" edc:desc="" edc:mask="0x1" edc:name="PCFG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG1" edc:desc="" edc:mask="0x1" edc:name="PCFG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG2" edc:desc="" edc:mask="0x1" edc:name="PCFG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG3" edc:desc="" edc:mask="0x1" edc:name="PCFG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VCFG0" edc:desc="" edc:mask="0x1" edc:name="VCFG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VCFG1" edc:desc="" edc:mask="0x1" edc:name="VCFG1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="ADCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000u0" edc:name="ADCON0" edc:nzwidth="0x8" edc:por="0-0000x0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO/nDONE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0xf" edc:name="CHS" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCAL" edc:desc="" edc:mask="0x1" edc:name="ADCAL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_DONE" edc:desc="" edc:mask="0x1" edc:name="GO_DONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:desc="" edc:mask="0x1" edc:name="CHS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS3" edc:desc="" edc:mask="0x1" edc:name="CHS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_DONE" edc:desc="" edc:mask="0x1" edc:name="GO_DONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:desc="" edc:mask="0x1" edc:name="CHS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS3" edc:desc="" edc:mask="0x1" edc:name="CHS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DONE" edc:desc="" edc:mask="0x1" edc:name="DONE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="nDONE" edc:desc="" edc:mask="0x1" edc:name="nDONE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
